-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: 2019-10-22 03:52:28
-- 服务器版本： 10.1.28-MariaDB
-- NODEJS Version: 5.6.32

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `cjz`
--

CREATE DATABASE IF NOT EXISTS `cjz1` DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci;
USE `cjz1`;

-- --------------------------------------------------------

--
-- 表的结构 `cjz_forums`
--

DROP TABLE IF EXISTS `cjz_forums`;
CREATE TABLE `cjz_forums` (
  `fid` int(11) NOT NULL,
  `uid` int(11) DEFAULT NULL,
  `uname` varchar(64) DEFAULT NULL,
  `nickname` varchar(128) DEFAULT NULL,
  `title` varchar(128) DEFAULT NULL,
  `time` bigint(20) DEFAULT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `cjz_forums`
--

INSERT INTO `cjz_forums` (`fid`, `uid`, `uname`, `nickname`, `title`, `time`) VALUES
(1, '1', 'cjz', '你好', '说去p图，回来人没的了，。', '132488645132'),
(2, '2', 'hhh', '匿名', '你在搞色情阿门', '15445446789451'),
(3, '3', 'ddd', '魔力但是', '酷睿双核i5处理器|256GB SSD|8GB内存|英特尔HD显卡620含共享显卡内存','1231313484845'),
(4, '4', 'rtrt', '个大概大概', '减好的结果', '1565454123113'),
(5, '5', 'ffgh', '个大概大概', '减好的结果','156464242123113'),
(6, '6', 'ddddggw', '个大概大概', '各行沽空黄金的果', '15687464565123113'),
(7, '1', 'cjz', '你好', '说去p图，回来人没的了，。', '132488645132'),
(8, '2', 'hhh', '匿名', '你在搞色情阿门', '15445446789451'),
(9, '3', 'ddd', '魔力但是', '酷睿双核i5处理器|256GB SSD|8GB内存|英特尔HD显卡620含共享显卡内存','1231313484845'),
(10, '4', 'rtrt', '个大概大概', '减好的结果', '1565454123113'),
(11, '5', 'ffgh', '个大概大概', '减好的结果','156464242123113'),
(12, '6', 'ddddggw', '个大概大概', '各行沽空黄金的果', '15687464565123113'),
(13, '1', 'cjz', '你好', '说去p图，回来人没的了，。', '132488645132'),
(14, '2', 'hhh', '匿名', '你在搞色情阿门', '15445446789451'),
(15, '3', 'ddd', '魔力但是', '酷睿双核i5处理器|256GB SSD|8GB内存|英特尔HD显卡620含共享显卡内存','1231313484845'),
(16, '4', 'rtrt', '个大概大概', '减好的结果', '1565454123113'),
(17, '5', 'ffgh', '个大概大概', '减好的结果','156464242123113'),
(18, '6', 'ddddggw', '个大概大概', '各行沽空黄金的果', '15687464565123113'),
(19, '1', 'cjz', '你好', '说去p图，回来人没的了，。', '132488645132'),
(20, '2', 'hhh', '匿名', '你在搞色情阿门', '15445446789451'),
(21, '3', 'ddd', '魔力但是', '酷睿双核i5处理器|256GB SSD|8GB内存|英特尔HD显卡620含共享显卡内存','1231313484845'),
(22, '4', 'rtrt', '个大概大概', '减好的结果', '1565454123113'),
(23, '5', 'ffgh', '个大概大概', '减好的结果','156464242123113'),
(24, '6', 'ddddggw', '个大概大概', '各行沽空黄金的果', '15687464565123113'),
(25, '1', 'cjz', '你好', '说去p图，回来人没的了，。', '132488645132'),
(26, '2', 'hhh', '匿名', '你在搞色情阿门', '15445446789451'),
(27, '3', 'ddd', '魔力但是', '酷睿双核i5处理器|256GB SSD|8GB内存|英特尔HD显卡620含共享显卡内存','1231313484845'),
(28, '4', 'rtrt', '个大概大概', '减好的结果', '1565454123113'),
(29, '5', 'ffgh', '个大概大概', '减好的结果','156464242123113'),
(30, '6', 'ddddggw', '个大概大概', '各行沽空黄金的果', '15687464565123113'),
(31, '1', 'cjz', '你好', '说去p图，回来人没的了，。', '132488645132'),
(32, '2', 'hhh', '匿名', '你在搞色情阿门', '15445446789451'),
(33, '3', 'ddd', '魔力但是', '酷睿双核i5处理器|256GB SSD|8GB内存|英特尔HD显卡620含共享显卡内存','1231313484845'),
(34, '4', 'rtrt', '个大概大概', '减好的结果', '1565454123113'),
(35, '5', 'ffgh', '个大概大概', '减好的结果','156464242123113'),
(36, '6', 'ddddggw', '个大概大概', '各行沽空黄金的果', '15687464565123113'),
(37, '1', 'cjz', '你好', '说去p图，回来人没的了，。', '132488645132'),
(38, '2', 'hhh', '匿名', '你在搞色情阿门', '15445446789451'),
(39, '3', 'ddd', '魔力但是', '酷睿双核i5处理器|256GB SSD|8GB内存|英特尔HD显卡620含共享显卡内存','1231313484845'),
(40, '4', 'rtrt', '个大概大概', '减好的结果', '1565454123113'),
(41, '5', 'ffgh', '个大概大概', '减好的结果','156464242123113'),
(42, '6', 'ddddggw', '个大概大概', '各行沽空黄金的果', '15687464565123113');

-- --------------------------------------------------------

--
-- Indexes for dumped tables
--

--
-- Indexes for table `cjz_forums`
--

-- PRIMARY KEY 约束唯一标识数据库表中的每条记录。

-- 主键必须包含唯一的值。

-- 主键列不能包含 NULL 值。

-- 每个表都应该有一个主键，并且每个表只能有一个主键。
ALTER TABLE `cjz_forums`
  ADD PRIMARY KEY (`fid`);
  
--
-- 在导出的表使用AUTO_INCREMENT
-- Auto-increment 会在新记录插入表中时生成一个唯一的数字。
-- 要让 AUTO_INCREMENT 序列以其他的值起始，请使用下面的 SQL 语法：

-- ALTER TABLE Persons AUTO_INCREMENT=100
--

--
-- 使用表AUTO_INCREMENT `cjz_forums`
--
ALTER TABLE `cjz_forums`
  MODIFY `fid` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=7;



